# Taps
tap 'aws/tap'
tap 'cloudflare/cloudflare'
tap 'github/gh'
tap 'oven-sh/bun'

# Formulae
brew 'ack'
brew 'aws-vault'
brew 'awscli'
# brew 'awsdac' # AWS Diagram as tool for drawing diagrams
brew 'bash'
brew 'bash-completion'
brew 'bat'
# brew 'bazel' # build tool google
brew 'biome'
brew 'cloudflared'
brew 'coreutils'
brew 'deno'
brew 'diffutils'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-delta'
brew 'grc'
brew 'grep'
brew 'httpie'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'mise'
brew 'neovim'
brew 'node'
brew 'openssh'
brew 'openjdk'
brew 'pnpm'
brew 'rbenv'
# brew 'redis'
brew 'ripgrep'
brew 'ruff'
brew 'rustup'
brew 'tmux'
brew 'starship'
brew 'uv'
brew 'wget'
brew 'wrk'
brew 'xh'
brew 'yarn'
brew 'yazi'
brew 'yq'
brew 'yt-dlp'
brew 'zoxide'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'oven-sh/bun/bun'
brew 'stats'

# Only install on macOS
if /darwin/ =~ RUBY_PLATFORM
  # Formulae
  cask 'cursor'
  cask 'dbngin'
  cask 'docker-desktop'
  cask 'dynobase'
  cask 'ghostty'
  cask 'github'
  cask 'zen'
  cask 'handbrake' # video transcoder
  cask 'imageoptim' # image optimizer
  cask 'iterm2'
  cask 'kap'
  cask 'linear-linear'
  cask 'ngrok'
  cask 'nosql-workbench'
  cask 'notion'
  cask 'notion-calendar'
  cask 'proxyman'
  cask 'raycast'
  cask 'session-manager-plugin' # AWS Session Manager
  cask 'nikitabobko/tap/aerospace'
  cask 'slack'
  cask 'obsidian'
  cask 'spotify'
  cask 'yaak'
  cask 'zoom'

  # Fonts
  cask 'font-hack-nerd-font'
  cask 'font-fira-code'
  cask 'font-jetbrains-mono'
  # cask 'font-hasklig'
  # cask 'font-inter'
  # cask 'font-iosevka'
  # cask 'font-office-code-pro'
  # cask 'font-outfit'
  # cask 'font-red-hat-display'
  # cask 'font-red-hat-mono'
  # cask 'font-red-hat-text'
  # cask 'font-source-code-pro'

  # Mac App Store Applications
  # mas '1Blocker', id: 1365531024
  # mas 'Xcode', id: 497799835

  # Cursor extensions
  vscode 'anthropic.claude-code'
  vscode 'biomejs.biome'
  vscode 'bradlc.vscode-tailwindcss'
  vscode 'esbenp.prettier-vscode'
  vscode 'GitHub.github-vscode-theme'
  vscode 'github.vscode-github-actions'
  vscode 'ms-python.debugpy'
  vscode 'ms-python.python'
  vscode 'ms-python.vscode-pylance'
  vscode 'oven.bun-vscode'
  vscode 'tamasfe.even-better-toml'
  vscode 'unifiedjs.vscode-mdx'
  vscode 'usernamehw.errorlens'
  vscode 'wayou.vscode-todo-highlight'
  vscode 'YoavBls.pretty-ts-errors'

  USING_VSCODE = false
  if USING_VSCODE then
    vscode 'github.codespaces'
    vscode 'github.copilot-chat'
    vscode 'github.copilot'
    vscode 'github.vscode-pull-request-github'
    vscode 'ms-python.vscode-python-envs'
    vscode 'ms-vscode-remote.remote-containers'
    vscode 'ms-vscode-remote.remote-ssh-edit'
    vscode 'ms-vscode-remote.remote-ssh'
    vscode 'ms-vscode.cpptools'
    vscode 'ms-vscode.remote-explorer'
    vscode 'ms-vsliveshare.vsliveshare'
    vscode 'visualstudioexptteam.vscodeintellicode'
  end
end

# Only install on Linux
if /linux/ =~ RUBY_PLATFORM
  # Formulae
  brew 'gcc'
end
